const test = {};

test.novel = `　　2022年7月29日第一章·全勤没了“这是谁啊，讲不讲武德啊！”叶子秋眼前一黑，捂着鲜血横流地脑袋，浑身发软地跌倒在地上。
　　原本喝完酒的叶子秋，走在路上，对着那幽暗地路灯，大声抱怨着社会的不公，领导的无良，可能是他的声音太大，超烦了别人，被不明飞行物击中了头部，晕倒过去。
　　而这时候，打到叶子秋头部的东西，忽然飞出一股黑烟，一股脑地钻进了叶子秋的身体之中。
　　路上的行人们看这叶子秋晕倒在地上，也不敢停留，纷纷躲避，唯恐是来碰瓷的，只剩下一些胆大的和好奇的人们凑过来查探。
　　“你们不要干看着啊，打120啊！”就在这时一个路过的年轻漂亮女子看到这种情况，连忙掏出手机拨通了120。
　　叶子秋醒来的时候已经在医院了，他躺在病床上，看着天花板，不知道发生了什么事，怎么自己就会昏迷，怎么头好疼？还有，这是哪？这是哪？
　　叶子秋努力回想昨晚发生的事情，他只记得自己昨晚喝了不少的酒，发了不少的牢骚，之后的什么再也记不清了。
　　“呀，你醒啦！”就在这时，病房门推开，走进来一个长相甜美，穿着白色护士服的漂亮女孩儿。
　　“美女我怎么在这里？”看着那个漂亮的小护士走进来，叶子秋也明白自己是进了医院，不过怎么进的医院她就不知道了，难道是自己喝多了，乱跑到医院来了？
　　“你昨晚喝多了，被不明的东西砸到了脑袋，被一名漂亮的小姐姐送了过来。”漂亮女护士看着叶子秋，露出甜美的微笑。
　　"啊，我想起来了。”叶子秋经过漂亮女护士的提醒这才想起昨晚发生的事。
　　“幸亏那名小姐姐送你送的及时，不然你可能就会因为失血过多而死了。”漂亮女护士脸色凝重地说道。
　　"她，人在哪，我得谢谢她才行。”叶子秋连忙坐起身来说道。
　　"她人早就走了。”漂亮女护士摇了摇头说道，随后又递给叶子秋一堆清单，说道：“喏，这是你昨晚的治疗费，签个字吧。”
　　叶子秋结果清单，看着那一串零，心脏狠狠地抽搐了几下，愁眉苦脸的说道：“不会吧，这么多！”
　　“因为你昨晚失血过多，医院给你进行过输血。”漂亮女护士看到叶子秋痛苦的表情，也忍不住同情了起来，但是却也不得不实话实说。
　　"好吧，我签。"看着那一串零，叶子秋无奈地点点头，拿出纸笔，快速的签下名字。“我现在可以出院了吧。”叶子秋问道，他可不敢再在这里待下去，鬼知道继续待下去会花掉他多少的积蓄。
　　“可以是可以，不过我们不建议您现在出院，最好进行一下住院观察。”漂亮女护士认真地看着叶子秋说道。
　　"不，不需要观察了，我现在很好，现在就出院。”叶子秋连忙摆了摆手，这住一天的院可比他一周的工资还多。
　　最^新^地^址:^
　　ＹＹＤＳＴxＴ．ＣＣ
　　"那好吧，你等一下，我把你办理出院手续。"漂亮女护士说完便走出了房间。
　　没多久，叶子秋便拿着漂亮女护士的办理出院证明，走出了医院的大门，看着高高挂起的太阳，突然想到了什么，大声喊道：“天啊要回学校开会我的全勤奖金啊！”
　　叶子秋回到学校后已经是下午了，因为他浑身的药味，他回房间里洗个澡换上衣服准备找他们学校的张校长解释清楚他不是不来开会而是遇到事故，住进了医院。
　　“张校长你好。”叶子企业刚关上自己的房门就看见他们学校的张校长走过来于是忙叫道。
　　“叶老师你今天下午为什么没有开会？”一脸怒气、露着满嘴黄牙、个子矮小的张校长生气地说道。
　　今天刚好县教育局的人来检查全校就差这个平时他自己最看不顺眼的人没有来，他这不是摆明和自己过不去吗？
　　其实张校长看叶子秋不顺眼不是因为叶子秋长得难看，其实叶子秋长得非常帅一米七八的个子，而且皮肤白皙，五官深邃，一双眼睛深邃如星辰般灿烂，鼻梁高挺，听说是全校最欢迎的男士。
　　就是因为这个张校长才生气他叶子秋凭什么是全校最欢迎的男士，这样的殊荣应该是他一校之长才有的。
　　“校长是这样的我昨晚因为一些原因住进了医院，喏，这是我的住院证明。”叶子秋拿出自己的住院证明，递给校长，小心地陪着笑。
　　他在学校里最看不惯的就是这个只会玩乐不会管学校的狗屁校长可现在自己有把柄给别人抓到只好小心翼翼了。
　　“住院？叶子秋，你别以为我不知道你昨晚是喝多了才进的医院！”张校长气得指着叶子秋的鼻子大骂。
　　他昨晚吃饭的时候就坐在叶子秋的附近，只不过叶子秋没有发现他罢了，他还听到叶子秋骂他的一些话，而那个不明的飞行物也是他扔向叶子秋的，只不过在发现砸出事后，便逃跑了。
　　“我，我。”叶子秋顿时哑口无言，他没想到张校长竟然看到他跟其他人喝酒的场景。
　　“叶子秋鉴于你因为酗酒导致今天不回来开会，这个月的全勤奖没有了。”张校长边说边生气地走了。
　　“没就没，有什么了不起。”叶子秋拍着胸膛对着张校长的背影骂道。
　　唉这个月又不见两百块的全勤奖金。叶子秋低着头心疼地叹着气。
　　“你还站在那干什么？”张校长看到叶子秋依然站在那，于是转过身来对叶子秋吼道。
　　“？”叶子秋满头问号，不明白自己站在这妨碍这傻逼校长什么事了。
　　“还不滚去上课，等着开除你是不是？"张校长指着叶子秋的鼻子骂道。
　　“啊，对，还有课来着。”叶子秋这才反应过来，自己还得去上课。说完，叶子秋急匆匆的赶往办公室拿上教案和课本后，朝教室跑去。
　　“铃铃铃”谁成想，叶子秋刚刚踏进教室的门口，下课的铃声便响了起来。教室里的所有学生都紧紧的盯着叶子秋，生害怕叶子秋突然给她们突然说一句拖延几分钟，虽然叶子秋平时没有拖过堂，虽然叶子秋是学校里最受欢迎的男士教师，但这并不代表着你可以拖堂。
　　叶子秋看着学生们紧紧的盯着自己，那祈求的眼神，那期待的目光，叶子秋尴尬的摸了摸鼻子说道："额，这个是上课铃声还是下课铃声？”
　　“
　　下课！”全班的学生异口同声，齐声回答道。
　　"那就下课？”叶子秋看着班上的学生们问道，看到学生们不约而同的点着头后说道："那好，下课！”
　　“欧耶！叶老师最好了！”全班学生高呼道，一个个脸上洋溢着笑容。
　　叶子秋看着全班的学生这么高兴的样子，摇了摇头，真是一群长不大的孩子，不过叶子秋想起自己在读书的时候也非常的讨厌那些老师拖堂，就算是现在也非常讨厌学校在下班后突然叫自己去开会。
　　看着闹腾的学生们，叶子秋也没管他们，转头回办公室，今天下午出了这一堂，就没有了，谁让他是教历史的呢，不像语数外以外，一整天安排的满满当当的。`;

test.html = `
<!-- https://www.xxbiqudu.com/modules/article/search.php?searchkey=%E6%B4%AA%E8%8D%92&t=8723 -->
<!doctype html>
<html>
    <head><title>this is title.</title></head>
    <body>
        <p>你好<span>作者</span></p>
    </body>
</html>
`

test.content_novel = function(){
    const b = document.getElementsByClassName('container')[0].getElementsByClassName('content')[0].getElementsByClassName('text_content')[0];
    b.innerHTML = test.novel;
}

test.get_content_size = function(){
    const b = document.getElementsByClassName('container')[0].getElementsByClassName('content')[0].getElementsByClassName('text_content')[0];
    console.log(b.clientWidth, b.clientHeight);
}


test.get = async function(){
    url = 'https://www.qbiqu.com/0_4/';
    type = 'GET';
    args = { encode: 'gbk' };

    const res = await electronAPI.request(url, type, args);
    console.log("获得网址内容：");
    console.log(res);

}